[
  {
    "question": "配布",
    "furigana": "",
    "meaning": "はいふ  \nPhân phát\n\n意味：Phân phát cái gì cho nhiều người bất kỳ.\n チラシ・ビラ・資料・書類\nTờ rơi, quảng cáo, tài liệu, giấy tờ, …\n\n • 新しくオープンするお店の宣伝をするため、駅前でチラシを配布した\n\nChúng tôi đã phát tờ rơi ở trước nhà ga để quảng bá cho cửa hàng mới khai trương."
  },
  {
    "question": "採取",
    "furigana": "",
    "meaning": "さいしゅ\n\nLấy, thu thập\n\n意味:Việc thu thập cái gì đó để điều tra, nghiên cứu.\n指紋、昆虫、血液：Dấu vân tay, côn trùng, máu, …\n\n •   警察では、被疑者から指紋を採取しています。\nCảnh sát đang lấy dấu vân tay của các nghi phạm."
  },
  {
    "question": "駆除",
    "furigana": "",
    "meaning": "くじょ\n\nTiêu diệt \n\n意味：Việc loại bỏ những thứ gây hại.\nウィルス、害虫：Virut, côn trùng, …\n\n   •   コンピューターウイルスは、一度駆除すれば終わりというものではありません。\nVirut trong máy tính sẽ không thế hết được nếu như chỉ diệt một lần."
  },
  {
    "question": "研修",
    "furigana": "",
    "meaning": "けんしゅう\n\nĐào tạo, huấn luyện \n\n意味：Đào tạo kỹ càng và có kế hoạch cho nhân viên tại công ty.\n「義務上」の知識：Những kiến thức liên quan đến công việc.\n\n   •   新入社員は社内研修で専門知識を学ぶ機会があります。\nNhân viên mới có cơ hội học hỏi những kiến thức chuyên môn thông qua kỳ tập huấn nội bộ của công ty."
  },
  {
    "question": "交渉",
    "furigana": "",
    "meaning": "こうしょう \n\nĐàm phán \n\n意味：Việc trao đổi với người có quan điểm khác mình để hướng đến thỏa thuận đôi bên.\n価格交渉、外交交渉、。。。\nĐàm phán giá cả, đàm phán ngoại giao, …\n\n   • この価格、交渉如何では、来年はもう仕入れないかも知れない。\nVới mức giá này, tùy vào việc đàm phán mà cũng có thể năm sau chúng ta sẽ không nhập hàng nữa."
  },
  {
    "question": "本音",
    "furigana": "",
    "meaning": "ほんね\n\nLời nói thật lòng \n\n意味：Những lời nói thật lòng từ trái tim (Từ trái nghĩa：建前：Nịnh bợ, khách sáo, …).\n本音・を言う／吐く／漏らす\n本音・でつき合う\n Nói ra/ Thú nhận/ Thổ lộ lời thật lòng. Yêu nhau thật lòng.\n\n• 「京都の人は建前を使って本音を言わない」と言われる時がある。\n Người dân Kyoto đôi khi bị nói là sống giả tạo, khách sáo chứ không\nnói những lời thật lòng."
  },
  {
    "question": "発足",
    "furigana": "",
    "meaning": "ほっそく\n\nThành lập\n\n意味:組織や団体などが新しく作られ、活動を始めること\nViệc bắt đầu đi vào hoạt động, tạo ra các tổ chức và nhóm mới.\n\n発足+させる\nĐược thành lập, thiết lập, …\n\n• A 市に町おこしのプロジェクト団体が発足する。\nMột nhóm dự án được thành lập ở thành phố A."
  },
  {
    "question": "目先",
    "furigana": "",
    "meaning": "めさき\n\nTrước mắt\n\n意味:すぐ目の前、すぐ近い将来にあること\nNhững việc trước mắt, những việc ở tương lai gần.\n\n  目先が+利く(先をよく見通す)\n  目先が+見えない(先を読めない)\nNhìn thấu được tương lai.\nTương lai mù mịt (không biết được tương lai).\n\n• 彼は目先が利く人なので、リーダーに向いているだろう。\nAnh ấy là một người có thể nhìn thấu tương lai nên anh ấy chắc sẽ trở thành một nhà lãnh đạo tốt."
  },
  {
    "question": "赴任",
    "furigana": "",
    "meaning": "ふにん\n\nChuyển công tác\n\n意味:仕事をする場所へ行くこと(遠く離れている、長期的)\nChuyển đến 1 địa điểm nào đó để làm việc (đi xa trong thời gian dài).\n\n海外赴任:Công tác nước ngoài.\n単身赴任:Đi công tác một mình\n\n• 東京本社から沖縄支社に赴任した。\nTôi chuyển công tác từ trụ sở chính Tokyo sang văn phòng chi nhánh ở Okinawa."
  },
  {
    "question": "抜粋",
    "furigana": "",
    "meaning": "ばっすい\n\nĐoạn trích, trích đoạn\n\n意味:書物や作品からすぐれた部分や必要な部分を抜き出すこと\nViệc trích ra những phần đặc sắc, cần thiết từ sách báo hay các tác phẩm.\n\n新聞記事・論文\nCác bài báo, luận văn, ...\n\n• 他人の文章を抜粋することで、自分が伝えたい内容に説得力が 増す。\nBằng cách trích ra những văn bản của người khác, tính thuyết phục của những nội dung bạn muốn truyền đạt sẽ tăng lên."
  },
  {
    "question": "ゆとり",
    "furigana": "",
    "meaning": "Dư dả, thong thả, thừa thãi\n\n意味:必要以上にあまる\nCó cái gì đó nhiều hơn mức cần thiết.\n\n{経済的/気持ち/心...}にゆとりがある。\n Dư dả về kinh tế, thoải mái, đầy đủ về tinh thần.\n\n• 引退してようやく生活にゆとりができた。\nSau khi nghỉ hưu thì cuối cùng tôi cũng có thể thoải mái tận hưởng\ncuộc sống dư dả (Cả về tiền bạc lẫn thời gian)."
  },
  {
    "question": "触発",
    "furigana": "",
    "meaning": "しょくはつ\n\nTruyền cảm hứng, xúc tác\n\n意味:刺激や影響を受けて行動する\nHành động sau khi bị kích thích, ảnh hưởng.\n\n触発+される:Được kích thích, truyền cảm hứng.\n\n• オリンピックに触発され、スポーツ用品を買う消費者が増える。\nĐược truyền cảm hứng từ thế vận hội Olympic, số người mua các thiết bị thể thao tăng lên."
  },
  {
    "question": "見込み",
    "furigana": "",
    "meaning": "み こみ\n\nDự kiến, khả năng, triển vọng\n\n意味:将来そうなるだろうという期待\nKỳ vọng một điều gì đó sẽ xảy ra trong tương lai.\n\n見込み+がある男:Người đàn ông có triển vọng. \n見込み+違い :Khác biệt so với kỳ vọng.\n\n•この会社では昇進の見込みがない。\nKhông có triển vọng thăng tiến tại công ty này."
  },
  {
    "question": "当面",
    "furigana": "",
    "meaning": "とうめん\n\nTrước mắt, hiện thời\n\n意味:現在直面していること(これからしばらく抱える課題)\nNhững điều chúng ta hiện đang phải đối mặt (các vấn đề phải đối\nmặt trong thời gian tới).\n\n• 当面の課題は、対立している両者の関係の調整である。\nVấn đề trước mắt là điều chỉnh mối quan hệ giữa hai bên đang xung\nđột."
  },
  {
    "question": "念願",
    "furigana": "",
    "meaning": "ねんがん\n\nĐiều hằng mong ước\n\n意味:常に心にかけて強く望むこと\nViệc bản thân luôn mong muốn, luôn hướng đến, khát khao mãnh liệt.\n念願が叶う :Điều ước trở thành hiện thực. 念願を果たす:Thực hiện mong muốn.\n\n• この夏休み、とうとう念願の海外旅行に行けた。\nKỳ nghỉ hè này, tôi đã thực hiện được mong muốn bấy lâu nay của mình là đi du lịch nước ngoài."
  },
  {
    "question": "発散",
    "furigana": "",
    "meaning": "はっさん\n\nPhát tán, tỏa ra\n\n意味:内部にたまったものが外部へ散らばって出ること\nViệc những thứ tích tụ bên trong được phát tán ra bên ngoài.\n\n熱・匂い・力・ストレス:Nhiệt độ, mùi, năng lực, căng thẳng, ... \n\n• この動物から悪臭が発散している。\nMùi hôi phát ra từ con vật này."
  },
  {
    "question": "従来",
    "furigana": "",
    "meaning": "じゅうらい\n\nTừ trước đến nay\n\n意味:以前から今までこれまで\nTừ trước cho đến nay.\n\n  従来通り、従来より、従来の方法\nNhư thường lệ, thông thường, phương pháp truyền thống, …\n\n• 会議で従来の方法の問題点が指摘された。\nTại cuộc họp, những vấn đề trong các phương pháp truyền thống đã\nđược chỉ ra."
  },
  {
    "question": "腕前",
    "furigana": "",
    "meaning": "うでまえ\n\nTay nghề, trình độ\n\n意味:身につけた技術・能力\nKhả năng, kỹ năng của bản thân.\n\n腕(前)が上がる:Tay nghề đi lên.\n腕(前)を上げる:Nâng cao tay nghề.\n\n• 職人の見事な腕前に、見ていた人々から拍手が沸いた。\nKhán giả vỗ tay giòn giã trước kỹ năng điêu luyện của người thợ lành nghề."
  },
  {
    "question": "人込み",
    "furigana": "",
    "meaning": "ひとごみ\n\nĐám đông\n\n意味:たくさんの人がいて込み合っていること\nNhiều người tập trung lại một chỗ.\n\n人込みをかき分ける:Lách qua đám đông.\n\n• 人込みの中で買い物をするのは嫌なので、平日に街に行きま\nしょう。\nViệc phải mua sắm trong đám đông chen chúc ấy rất khó chịu nên hãy đi lên phố vào ngày thường nha."
  },
  {
    "question": "気掛かり",
    "furigana": "",
    "meaning": "き がかり\n\nLo lắng\n\n意味:何か悪いことが起こらないかと考えて落ち着かない\nBồn chồn, lo lắng điều gì xấu sẽ xảy ra.\n• 娘が一人で生活していることが一番気掛かりだ。\nViệc con gái đang sống một mình là điều khiến tôi bất an, lo lắng nhất."
  }
]